tap "aylei/tap"
tap "azure/functions"
tap "derailed/k9s
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "cask"
brew "docker", link: false
brew "fasd"
brew "hub"
brew "nvm"
brew "proxychains-ng"
brew "aylei/tap/kubectl-debug"
brew "azure/functions/azure-functions-core-tools"
cask "alacritty"
cask "alfred2"
cask "apache-directory-studio"
cask "docker"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-photos-backup-and-sync"
cask "gpg-suite"
cask "insomnia"
cask "iterm2"
cask "minikube"
cask "notion"
cask "powershell"
cask "r"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
