tap "homebrew/bundle"
brew "asdf"
brew "autojump"
brew "awscli"
brew "aws-vault"
brew "azure-cli"
brew "bat"
brew "bkt"
brew "coreutils"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gron"
brew "httpie"
brew "jq"
brew "k9s"
brew "kubectx"
brew "mas"
brew "peco"
brew "powerlevel10k"
brew "starship"
brew "tailscale"
brew "zinit"
brew "jfryy/tap/qq"
cask "bitwarden"
cask "devpod"
cask "docker"
cask "git-credential-manager"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "notion"
cask "visual-studio-code"
cask "warp"
cask "wavebox"
cask "zoom"
