tap "abhimanyu003/sttr"

# Needed to login to eks through AD
tap "azure/kubelogin"
tap "coder/coder"
tap "derailed/popeye"
tap "jfryy/tap"
tap "pomdtr/tap"
# shell history
brew "atuin"
# Shell extension to jump to frequently used directories
brew "autojump"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI utility for caching the output of subprocesses
brew "bkt"
# autocomplete 
brew "carapace"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line csv viewer
brew "csvlens"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS Client for Humans
brew "doggo"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Make JSON greppable
brew "gron"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# k3d for running k3s in Docker
brew "k3d"
# Kubernetes CLI to manage your clusters in style
brew "k9s"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Access large language models from the command-line
brew "llm"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Simplistic interactive filtering tool
brew "peco"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# Find and verify credentials
brew "trufflehog"
# smart cd
brew "zoxide"
# zx 
brew "zx"
# A cross-platform, cli app to perform various string operations.
brew "abhimanyu003/sttr/sttr"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Provisions remote development environments via Terraform
brew "coder/coder/coder"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# Multi-tool structured format processor for query and transcoding
brew "jfryy/tap/qq"
# Open source IDE for exploring and testing APIs
cask "bruno"
# UI to create reproducible developer environments based on a devcontainer.json
cask "devpod"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite"
# Discover, download, and run local LLMs
cask "lm-studio"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Web browser
cask "wavebox"
# editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adamhartford.vscode-base64"
vscode "asvetliakov.vscode-neovim"
vscode "aswinkumar863.smarty-template-support"
vscode "aws-scripting-guy.cform"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "coder.coder-remote"
vscode "continue.continue"
vscode "d-biehl.robotcode"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "dineug.vuerd-vscode"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "humao.rest-client"
vscode "jhhtaylor.tabstronaut"
vscode "jvalecillos.gpg"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mssql"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robocorp.robotframework-lsp"
vscode "rosshamish.kuskus-kusto-syntax-highlighting"
vscode "ryanolsonx.zenburn"
vscode "ryu1kn.partial-diff"
vscode "slevesque.vscode-multiclip"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "wmaurer.vscode-jumpy"
vscode "yatki.vscode-surround"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
